mybesttools/ESP32-TUX-BAMBULAB/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions/partition-8MB.csv"
CONFIG_TUX_DEVICE_WT32_SC01_PLUS=y
CONFIG_TIMEZONE_STRING="WET0WEST,M3.5.0/1,M10.5.0/2"
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_ESP_TLS_INSECURE=y
CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY=y
CONFIG_PERIPH_CTRL_FUNC_IN_IRAM=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
# Reserve more internal RAM for DMA operations (default 32768, increase for multi-TLS)
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FATFS_LFN_HEAP=y
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=2048
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
# Disable hardware AES - uses internal RAM for DMA which can exhaust with multiple TLS connections
# Software AES is slightly slower but allocates from PSRAM (via MBEDTLS_EXTERNAL_MEM_ALLOC)
# See: https://github.com/espressif/esp-idf/issues/9935
CONFIG_MBEDTLS_HARDWARE_AES=n
# CONFIG_MBEDTLS_CERTIFICATE_BUNDLE is not set
# CONFIG_LV_CONF_SKIP is not set
